test/requests/payee_status_update_success_req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap12:Body>
    <PayeeStatusUpdate xmlns="http://Tipalti.org/">
      <payerName>MyPayer</payerName>
      <timestamp>1521234048</timestamp>
      <key>e7b67a6628a980c8da6bc057e8f52943bfedb1cddb44ff2ba65e1b0878568e85</key>
      <idap>somepayee</idap>
      <status>Blocked</status>
      <reason>Business closed</reason>
    </PayeeStatusUpdate>
  </soap12:Body>
</soap12:Envelope>
